<a href="https://colab.research.google.com/github/marcellapbp/Aprendendo-Python/blob/master/Curso_Analytics_Vidhya_Introduction_to_Python.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Curso 1 Analytics Vidhya | Introduction to Python

*Analytics Vidhya provides a community based knowledge portal for Analytics and Data Science professionals. The aim of the platform is to become a complete portal serving all knowledge and career needs of Data Science Professionals.* 
<br>
From https://www.analyticsvidhya.com/about-me/

In order to make progress on Path to Become Data Scientist in 2020 Course, it is required to complete Introduction to Python Course first. The first topics on this course, I've already learned on Data Science Academy course "Python Fundamentos para An√°lise de Dados", so I'm practicing the topics are new for me.

##Data Manipulation and Visualization

In [1]:
#import libraries
import pandas as pd
import numpy as np

#read csv file
df = pd.read_csv("/content/bigmart_data.csv")

#show top 5 rows
df.head()

  Item_Identifier  Item_Weight  ...        Outlet_Type  Item_Outlet_Sales
0           FDA15         9.30  ...  Supermarket Type1          3735.1380
1           DRC01         5.92  ...  Supermarket Type2           443.4228
2           FDN15        17.50  ...  Supermarket Type1          2097.2700
3           FDX07        19.20  ...      Grocery Store           732.3800
4           NCD19         8.93  ...  Supermarket Type1           994.7052

[5 rows x 12 columns]

In [6]:
#second way to show 5 top rows
df.iloc[:5]

  Item_Identifier  Item_Weight  ...        Outlet_Type  Item_Outlet_Sales
0           FDA15         9.30  ...  Supermarket Type1          3735.1380
1           DRC01         5.92  ...  Supermarket Type2           443.4228
2           FDN15        17.50  ...  Supermarket Type1          2097.2700
3           FDX07        19.20  ...      Grocery Store           732.3800
4           NCD19         8.93  ...  Supermarket Type1           994.7052

[5 rows x 12 columns]

In [7]:
#third way to show 5 top rows
df[:5]

  Item_Identifier  Item_Weight  ...        Outlet_Type  Item_Outlet_Sales
0           FDA15         9.30  ...  Supermarket Type1          3735.1380
1           DRC01         5.92  ...  Supermarket Type2           443.4228
2           FDN15        17.50  ...  Supermarket Type1          2097.2700
3           FDX07        19.20  ...      Grocery Store           732.3800
4           NCD19         8.93  ...  Supermarket Type1           994.7052

[5 rows x 12 columns]

In [8]:
#count how many null values exist on each colums
df.isnull().sum()

Item_Identifier                 0
Item_Weight                  1463
Item_Fat_Content                0
Item_Visibility                 0
Item_Type                       0
Item_MRP                        0
Outlet_Identifier               0
Outlet_Establishment_Year       0
Outlet_Size                  2410
Outlet_Location_Type            0
Outlet_Type                     0
Item_Outlet_Sales               0
dtype: int64

In [9]:
#count rows before eliminate NaN values
df.shape

(8523, 12)

In [11]:
#drop the intire rows if there is any NaN value
df = df.dropna(how='any')

In [12]:
#check the result
df.shape

(4650, 12)

###Sorting Data Frames

####1. Sorting by Values

In [13]:
#sort dataset chosing a column, ascending is the default option
sorted_data = df.sort_values(by='Item_Type')
sorted_data[:5]

     Item_Identifier  Item_Weight  ...        Outlet_Type  Item_Outlet_Sales
6085           FDO60       20.000  ...  Supermarket Type1           401.4774
6043           FDT12        6.215  ...  Supermarket Type2           677.1186
6030           FDS12        9.100  ...  Supermarket Type1          2390.8878
6029           FDM24        6.135  ...  Supermarket Type1          3325.0052
6003           FDY11        6.710  ...  Supermarket Type1          1516.0266

[5 rows x 12 columns]

In [14]:
#to change the original dataset, we need to use inplace option
#before using inplace, the original dataframe is not sorted
df[:5]

  Item_Identifier  Item_Weight  ...        Outlet_Type  Item_Outlet_Sales
0           FDA15        9.300  ...  Supermarket Type1          3735.1380
1           DRC01        5.920  ...  Supermarket Type2           443.4228
2           FDN15       17.500  ...  Supermarket Type1          2097.2700
4           NCD19        8.930  ...  Supermarket Type1           994.7052
5           FDP36       10.395  ...  Supermarket Type2           556.6088

[5 rows x 12 columns]

In [16]:
#now the original dataset is sorted, but this time using descending order
df.sort_values(by='Item_Type', ascending=False, inplace=True)
df[:5]

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

     Item_Identifier  Item_Weight  ...        Outlet_Type  Item_Outlet_Sales
2387           FDF35       15.000  ...  Supermarket Type1          1179.1318
146            FDB11       16.000  ...  Supermarket Type1          6301.1312
5769           FDC35        7.435  ...  Supermarket Type2          1656.5104
5754           FDH47       13.500  ...  Supermarket Type1          1944.1360
1376           FDH35       18.250  ...  Supermarket Type1          1151.1682

[5 rows x 12 columns]

In [23]:
#it is possible to sort using more than one column using a list
df.sort_values(by=['Item_Type','Item_MRP'], ascending=False, inplace=True)
df[:5]

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

     Item_Identifier  Item_Weight  ...        Outlet_Type  Item_Outlet_Sales
1861           FDG47        12.80  ...  Supermarket Type1          2885.5772
6723           FDG47        12.80  ...  Supermarket Type1          4984.1788
4454           FDG47        12.80  ...  Supermarket Type2          3410.2276
1254           FDG47        12.80  ...  Supermarket Type1          8132.0812
5668           FDD11        12.85  ...  Supermarket Type1          2530.0400

[5 rows x 12 columns]

####2. Sorting by Index

In [26]:
#to go back to original order, we can use this function
df.sort_index(inplace=True)
df[:5]

  Item_Identifier  Item_Weight  ...        Outlet_Type  Item_Outlet_Sales
0           FDA15        9.300  ...  Supermarket Type1          3735.1380
1           DRC01        5.920  ...  Supermarket Type2           443.4228
2           FDN15       17.500  ...  Supermarket Type1          2097.2700
4           NCD19        8.930  ...  Supermarket Type1           994.7052
5           FDP36       10.395  ...  Supermarket Type2           556.6088

[5 rows x 12 columns]

###Merge and Concat Functions

####1. Concat

In [29]:
#creating dummy data

df1 = pd.DataFrame({'A':['A0','A1','A2','A3'],
                    'B':['B0','B1','B2','B3'],
                    'C':['C0','C1','C2','C3'],
                    'D':['D0','D1','D2','D3']},
                    index=[0,1,2,3])
df2 = pd.DataFrame({'A':['A4','A5','A6','A7'],
                    'B':['B4','B5','B6','B7'],
                    'C':['C4','C5','C6','C7'],
                    'D':['D4','D5','D6','D7']},
                    index=[4,5,6,7])

In [31]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [32]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [35]:
#since the content are from both DataFrames are equivalent, the only difference is the index
#we can unify both dataframes
result = pd.concat([df1,df2])
result

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [36]:
#after concating we can identify which part is from which original dataframe by using keys
result = pd.concat([df1,df2], keys=['x','y'])
result

      A   B   C   D
x 0  A0  B0  C0  D0
  1  A1  B1  C1  D1
  2  A2  B2  C2  D2
  3  A3  B3  C3  D3
y 4  A4  B4  C4  D4
  5  A5  B5  C5  D5
  6  A6  B6  C6  D6
  7  A7  B7  C7  D7

In [37]:
#another test
df3 = pd.DataFrame({'A':['A0','A1','A6','A7'],
                    'B':['B0','B1','B6','B7'],
                    'C':['C0','C1','C6','C7'],
                    'D':['D0','D1','D6','D7']},
                    index=[0,1,6,7])
df4 = pd.DataFrame({'A':['A2','A3','A4','A5'],
                    'B':['B2','B3','B4','B5'],
                    'C':['C2','C3','C4','C5'],
                    'D':['D2','D3','D4','D5']},
                    index=[2,3,4,5])

In [38]:
df3

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [39]:
df4

    A   B   C   D
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5

In [50]:
result = pd.concat([df3,df4], keys=['x','y'])
result

      A   B   C   D
x 0  A0  B0  C0  D0
  1  A1  B1  C1  D1
  6  A6  B6  C6  D6
  7  A7  B7  C7  D7
y 2  A2  B2  C2  D2
  3  A3  B3  C3  D3
  4  A4  B4  C4  D4
  5  A5  B5  C5  D5

In [47]:
#get second Data Frame
result.loc['y']

    A   B   C   D
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5

##### Outer Join

In [52]:
#creating another data frame in way to try different types of join
df5 = pd.DataFrame({'B':['B2','B3','B6','B7'],
                    'D':['D2','D3','D6','D7'],
                    'F':['F2','F3','F6','F7']},
                   index=[2,3,6,7])
df5

    B   D   F
2  B2  D2  F2
3  B3  D3  F3
6  B6  D6  F6
7  B7  D7  F7

In [55]:
#concat by columns, it matches by index
#using Outer Join , there is no loss of information
#rows which index is on both data frames there is no NaN values
result = pd.concat([df1,df5],axis=1,sort=False)
result

     A    B    C    D    B    D    F
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D7   F7

In [56]:
#how it would be the result concating by index instead of columns
result = pd.concat([df1,df5])
result

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
2  NaN  B2  NaN  D2   F2
3  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

In [60]:
#if we want the Outer Join Result, but bu keep only the amount of rows from df1, use join_axes option
#deprecated code
result = pd.concat([df1, df4], axis=1, join_axes=[df1.index])
result

TypeError: ignored

#####Inner Join

In [58]:
#result using inner join, only show intersection result
result = pd.concat([df1,df5],axis=1,join='inner')
result

    A   B   C   D   B   D   F
2  A2  B2  C2  D2  B2  D2  F2
3  A3  B3  C3  D3  B3  D3  F3

####Merge

#####Inner Join

In [68]:
#creaty dummy data

df_score = pd.DataFrame({'student_id':[0,1,2,3],
                         'subject_id':[0,0,0,0],
                         'score'     :[10,9,5,7]})

df_student = pd.DataFrame({'student_id':[0,2,3,4],
                           'student_name':['Maria','Joao','Gabriel','Juliana']})

df_subject = pd.DataFrame({'subject_id':[0,1,2],
                           'subject_name':['Math','English','Arts']})

In [64]:
df_score

   student_id  subject_id  score
0           0           0     10
1           1           0      9
2           2           0      5
3           3           0      7

In [65]:
df_student

   student_id student_name
0           0        Maria
1           2         Joao
2           3      Gabriel
3           4      Juliana

In [69]:
df_subject

   subject_id subject_name
0           0         Math
1           1      English
2           2         Arts

In [67]:
#join only rows that matches on both data frames by the column indicated student_id
#inner join is default
result = pd.merge(df_student,df_score,on='student_id')
result

   student_id student_name  subject_id  score
0           0        Maria           0     10
1           2         Joao           0      5
2           3      Gabriel           0      7

In [70]:
#join 3 datasets
result = pd.merge(df_student,df_score,on='student_id')
result2 = pd.merge(result,df_subject,on='subject_id')
result2

   student_id student_name  subject_id  score subject_name
0           0        Maria           0     10         Math
1           2         Joao           0      5         Math
2           3      Gabriel           0      7         Math

In [72]:
#duplicating student data frame
df_student2 = pd.DataFrame({'student_id':[2,4,5,6],
                           'student_name':['Joao','Juliana','Lucas','Isadora']})

In [73]:
df_student2

   student_id student_name
0           2         Joao
1           4      Juliana
2           5        Lucas
3           6      Isadora

In [75]:
#when column is duplicated it adds _x to the first df and _y to the second
result = pd.merge(df_student,df_student2,on='student_id')
result

   student_id student_name_x student_name_y
0           2           Joao           Joao
1           4        Juliana        Juliana

#####Outer Join

In [71]:
#show all information, if there is information on both data frames, it is available on both sides
#if the information exists only in one of thh data frames, the column representing the other will contain null values

#student_id 1 is not registered, but there is a score registered
#student_id 4 is Juliana, but she doesn't have any score
result = pd.merge(df_student,df_score,on='student_id', how='outer')
result

   student_id student_name  subject_id  score
0           0        Maria         0.0   10.0
1           2         Joao         0.0    5.0
2           3      Gabriel         0.0    7.0
3           4      Juliana         NaN    NaN
4           1          NaN         0.0    9.0

#####Right Join

In [76]:
#show all information from df_student2 (Right Data Frame)
#but on df_students show only the information that matches to the other
result = pd.merge(df_student,df_student2,on='student_id',how='right')
result

   student_id student_name_x student_name_y
0           2           Joao           Joao
1           4        Juliana        Juliana
2           5            NaN          Lucas
3           6            NaN        Isadora

#####Left Join

In [77]:
#show all information from df_student (Left Data Frame)
#but on df_students2 show only the information that matches to the other
result = pd.merge(df_student,df_student2,on='student_id',how='left')
result

   student_id student_name_x student_name_y
0           0          Maria            NaN
1           2           Joao           Joao
2           3        Gabriel            NaN
3           4        Juliana        Juliana